#### Three Approaches
1. Creating Database files using Python - sqlite3
2. Connecting with a existing Database - MySQL
3. Connecting with an unknown database - SQL Server - PyODBC

In [ ]:
# !pip install sqlite3

In [1]:
import os
os.getcwd()

'C:\\Users\\91965\\Documents\\Besant\\Python Programming\\Jan Batch'

In [2]:
import sqlite3 as sql

connection = sql.connect('newdatabase.db')

crsr = connection.cursor() #bridgss connection between Database & Python

create_table = """create table employee(
firstname varchar(50),
lastname varchar(50),
gender char(1),
salary float(15)
)"""

crsr.execute(create_table)

value1 = """insert into employee values('Gowtham', 'Kumar', 'M', 55.5)"""
crsr.execute(value1)

value2 = """insert into employee values('Varun', 'Kumar', 'M', 75.5)"""
crsr.execute(value2)

connection.commit()

connection.close()

In [3]:
conn = sql.connect('newdatabase.db')
crsr = conn.cursor()

retrievevalues = """Select * from employee"""
crsr.execute(retrievevalues)

output = crsr.fetchone()

for i in output:
    print(i)

Gowtham
Kumar
M
55.5

In [4]:
conn = sql.connect('newdatabase.db')
crsr = conn.cursor()

crsr.execute("""Select * from employee""")

output = crsr.fetchall()

for i in output:
    print(i)

('Gowtham', 'Kumar', 'M', 55.5)
('Varun', 'Kumar', 'M', 75.5)

In [5]:
# Updation & Deletion Operation

conn = sql.connect('newdatabase.db')
crsr = conn.cursor()

crsr.execute("""update employee set firstname = 'Devi' where firstname = 'Gowtham'""")
crsr.execute("""update employee set gender = 'F' where firstname = 'Devi'""")
conn.commit()

print('Number of Changed Rows:', conn.total_changes)

output = crsr.execute('Select * from employee')

for i in output:
    print(i)

Number of Changed Rows: 2
('Devi', 'Kumar', 'F', 55.5)
('Varun', 'Kumar', 'M', 75.5)

In [7]:
# Updation & Deletion Operation

conn = sql.connect('newdatabase.db')
crsr = conn.cursor()

crsr.execute("""delete from employee where firstname = 'Devi'""")
conn.commit()

print('Number of Changed Rows:', conn.total_changes)

output = crsr.execute('Select * from employee')

for i in output:
    print(i)

Number of Changed Rows: 1
('Varun', 'Kumar', 'M', 75.5)

In [8]:
conn = sql.connect('newdatabase.db')
crsr = conn.cursor()

value1 = """insert into employee values('Gowtham', 'Kumar', 'M', 45.5)"""
crsr.execute(value1)
conn.commit()

output = crsr.execute('Select * from employee')

for i in output:
    print(i)

('Varun', 'Kumar', 'M', 75.5)
('Gowtham', 'Kumar', 'M', 45.5)

In [9]:
conn = sql.connect('newdatabase.db')
crsr = conn.cursor()

conn.execute("""Delete from employee where firstname = 'Gowtham'""")
conn.commit()

print('Number of Changed Rows:', conn.total_changes)

output = crsr.execute('Select * from employee')

for i in output:
    print(i)

Number of Changed Rows: 1
('Varun', 'Kumar', 'M', 75.5)

In [11]:
conn = sql.connect('newdatabase.db')
crsr = conn.cursor()
crsr.execute("""Create table demogag2(name, age, designation)""")

print('Enter 5 Names:')
name = [input() for i in range(5)]
print('Enter their Age:')
age = [int(input()) for i in range(5)]
print('Enter their Designation:')
designation = [input() for i in range(5)]

for i in range(5):
    
    crsr.execute("""Insert into demogag2 values (?,?,?)""", (name[i], age[i], designation[i]))
    
    crsr.execute('Select * from demogag2')
    
    print(crsr.fetchall())

Enter 5 Names:
A
B
C
D
E
Enter their Age:
18
19
20
21
22
Enter their Designation:
SD
SD
DA
DS
TD
[('A', 18, 'SD')]
[('A', 18, 'SD'), ('B', 19, 'SD')]
[('A', 18, 'SD'), ('B', 19, 'SD'), ('C', 20, 'DA')]
[('A', 18, 'SD'), ('B', 19, 'SD'), ('C', 20, 'DA'), ('D', 21, 'DS')]
[('A', 18, 'SD'), ('B', 19, 'SD'), ('C', 20, 'DA'), ('D', 21, 'DS'), ('E', 22, 'TD')]

In [ ]:
conn.close()

In [12]:
conn = sql.connect('newdatabase.db')

crsr = conn.cursor()

crsr.executescript("""
create table student(
firstname,
lastname,
age,
class);

create table teachers(
firstname,
lastname,
experience,
salary
);

insert into teachers values('Smith', 'Steve', 15, 75);
""")

sql = "Select * from teachers"

crsr.execute(sql)

output = crsr.fetchall()

print(output)

conn.commit()

conn.close()

[('Smith', 'Steve', 15, 75)]

In [13]:
# executemany()

import sqlite3 as sql

conn = sql.connect('newdatabase.db')

crsr = conn.cursor()

a = [('A', 'AA', 18, 55), ('B', 'BB', 25, 75), ('C', 'CC', 38, 105)]

crsr.executemany("""insert into student values(?, ?, ?, ?)""", a)

crsr.execute("Select * from student")

output = crsr.fetchall()

for i in output:
    print(i)
    
conn.commit()

conn.close()

('A', 'AA', 18, 55)
('B', 'BB', 25, 75)
('C', 'CC', 38, 105)

In [18]:
conn = sql.connect('newdatabase.db')

crsr = conn.cursor()

crsr.execute('SELECT name from sqlite_master where type= "table"')

output = crsr.fetchall()

for i in output:
    print(i)

('employee',)
('demogag4',)
('demogag2',)
('student',)
('teachers',)

In [19]:
# MySQL Connection - mysql.connector

import mysql.connector as ms

In [20]:
mydb = ms.connect(
host = 'localhost',
    user = 'root',
    passwd = 'Muthuyuvan@05')
    
print(mydb)
    
crsr = mydb.cursor()
    
crsr.execute('show databases')

for i in crsr:
    print(i)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001FC4BA01148>
('information_schema',)
('mysql',)
('performance_schema',)
('practise',)
('sakila',)
('sys',)

In [25]:
mydb = ms.connect(
host = 'localhost',
    user = 'root',
    passwd = 'Muthuyuvan@05',
database = 'practise')

crsr = mydb.cursor()
    
crsr.execute("""select b.cust_name as 'Customer Name', 
sum(a.purch_amt)  as 'Money Spent'
from Orders a 
join customers b
on a.customer_id = b.customer_id
group by b.cust_name 
having sum(a.purch_amt) > 200
order by sum(a.purch_amt) desc""")

output = crsr.fetchall()

for i in output:
    print(i)

('Nick Rimando', 8870.86)
('Geoff Camero', 2590.9)
('Brad Davis', 2400.6)
('Fabian Johns', 1983.43)
('Graham Zusi', 1059.0)
('Brad Guzan', 270.65)
('Julian Green', 250.45)

In [28]:
mydb = ms.connect(
host = 'localhost',
    user = 'root',
    passwd = 'Muthuyuvan@05',
database = 'sakila')

crsr = mydb.cursor()

crsr.execute("""create table students2(
firstname varchar(50), lastname varchar(50), age int(3), salary int(5))""")

a = [('A', 'AA', 18, 55), ('B', 'BB', 25, 75), ('C', 'CC', 38, 105)]

crsr.executemany("""insert into new6 values(%s, %s, %s, %s)""", a)

crsr.execute("Select * from students2")

output = crsr.fetchall()

for i in output:
    print(i)
    
mydb.commit()

In [29]:
# ODBC Connections

import pyodbc as od

In [30]:
conn = od.connect("Driver={SQL Server Native Client 11.0};"
                 "Server=LAPTOP-LFBVI1JS\SQLEXPRESS;"
                 "Database=master;"
                 "Trusted_Connection=yes;")

crsr = conn.cursor()

output = crsr.execute("""select a.ord_no as 'Order Id', 
c.name as 'Salesman', b.cust_name as 'Customer Name',
sum(a.purch_amt) as 'Sales', sum(a.purch_amt) * c.commission as 'Commission'
from Orders a
join Customers b
on a.customer_id = b.customer_id
join Salesman c
on a.salesman_id = c.salesman_id
group by a.ord_no, c.name, b.cust_name, c.commission""")

for i in output:
    print(i)

('70001', 'Nail Knite', 'Graham Zusi', Decimal('150.50'), Decimal('19.5650'))
('70002', 'James Hoog', ' Nick Rimando', Decimal('65.26'), Decimal('9.7890'))
('70005', 'James Hoog', 'Brad Davis ', Decimal('2400.60'), Decimal('360.0900'))
('70007', 'Nail Knite', 'Graham Zusi', Decimal('948.50'), Decimal('123.3050'))
('70008', 'James Hoog', ' Nick Rimando', Decimal('5760.00'), Decimal('864.0000'))
('70010', 'Mc Lyon', 'Fabian Johns', Decimal('1983.43'), Decimal('277.6802'))
('70012', 'Nail Knite', 'Julian Green', Decimal('250.45'), Decimal('32.5585'))
('70013', 'James Hoog', ' Nick Rimando', Decimal('3045.60'), Decimal('456.8400'))